# Terminal + Neovim setup.
# Anything not directly required by the shell or nvim lives elsewhere
# (per-project repos, manual install, etc).

brew "tmux"

# zsh layer
brew "antidote"      # plugin manager (sourced in .zshrc)
brew "atuin"         # ctrl-r history search
brew "zoxide"        # `z` / `zi`
brew "fzf"           # ctrl-t / alt-c / fzf-tab

# CLI replacements wired into .zshrc aliases
brew "bat"           # `cat`
brew "eza"           # `ls` / `ll` / `la` / `lt`
brew "lazygit"       # `lg`

# referenced by the cheatsheet
brew "gh"
brew "tldr"
brew "ripgrep"       # rg
brew "fd"            # fd (replaces ~/.cargo/bin/fd)

# editor
brew "neovim"
brew "node"          # mason / copilot / LSP servers under LazyVim
brew "uv"            # python provider for nvim + ruff/mypy installs

# nerd font for powerlevel10k glyphs
cask "font-meslo-lg-nerd-font"
